Enums/ВидыОперацийОплатаБанковскойКартой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийОплатаБанковскойКартой</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаБанковскойКартой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СчетНаОплату.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СчетНаОплату</Name>
			<Comment>Счет на оплату</Comment>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УДАЛИТЬ_ОплатаПоСчетам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЗаказам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Потолок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бесплатно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Потолок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бесплатно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СнятиеРезервов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СнятиеРезервов</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.Резервирование</xr:Item>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезервеНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРезерва</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТабличнойЧасти</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТабличнойЧасти</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/СозданиеНаОснованииПотолкиКлиент/Ext/Module.bsl
//#9376

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьНаОснованииМножественныйВыбор(ИмяФормы, МассивСсылок, ПараметрыВыполнения, ДополнительныеПараметрыОткрытия=Неопределено)
	
	ПараметрыВыполненияКоманды = Новый Структура("Источник,Уникальность,Окно,НавигационнаяСсылка");
	Если НЕ ПараметрыВыполнения = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыВыполненияКоманды, ПараметрыВыполнения.ОписаниеКоманды.ДополнительныеПараметры);
	КонецЕсли;	
	ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", Новый Структура("МассивДокументов", МассивСсылок));
	Если НЕ ДополнительныеПараметрыОткрытия = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыОткрытия.ЗначенияЗаполнения, ДополнительныеПараметрыОткрытия);
	КонецЕсли;
	
	ОткрытьФорму(
		ИмяФормы,
		ПараметрыОткрытия,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
КонецПроцедуры

Процедура СчетНаОплатуСоздатьНаОснованииМножественныйВыбор(МассивСсылок, ПараметрыВыполнения) Экспорт
	
	СоздатьНаОснованииМножественныйВыбор("Документ.СчетНаОплату.ФормаОбъекта", МассивСсылок, ПараметрыВыполнения);
		
КонецПроцедуры

Процедура ОплатаБанковскойКартойСоздатьНаОснованииМножественныйВыбор(МассивСсылок, ПараметрыВыполнения) Экспорт
	
	СоздатьНаОснованииМножественныйВыбор("Документ.ОплатаБанковскойКартой.ФормаОбъекта", МассивСсылок, ПараметрыВыполнения);
	
КонецПроцедуры

Процедура ОплатаКредитомСоздатьНаОснованииМножественныйВыбор(МассивСсылок, ПараметрыВыполнения) Экспорт
	
	ДополнительныеПараметрыОткрытия = Новый Структура("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийОплатаБанковскойКартой.Кредит"));	
	СоздатьНаОснованииМножественныйВыбор("Документ.ОплатаБанковскойКартой.ФормаОбъекта", МассивСсылок, ПараметрыВыполнения, ДополнительныеПараметрыОткрытия);
	
КонецПроцедуры

Процедура ПриходныйКассовыйОрдерСоздатьНаОснованииМножественныйВыбор(МассивСсылок, ПараметрыВыполнения) Экспорт
	
	СоздатьНаОснованииМножественныйВыбор("Документ.ПриходныйКассовыйОрдер.ФормаОбъекта", МассивСсылок, ПараметрыВыполнения);
	
КонецПроцедуры

Процедура ПоступлениеНаРасчетныйСчетСоздатьНаОснованииМножественныйВыбор(МассивСсылок, ПараметрыВыполнения) Экспорт
	
	СоздатьНаОснованииМножественныйВыбор("Документ.ПоступлениеНаРасчетныйСчет.ФормаОбъекта", МассивСсылок, ПараметрыВыполнения);
	
КонецПроцедуры

Процедура СнятиеРезервовСоздатьНаОснованииМножественныйВыбор(МассивСсылок, ПараметрыВыполнения) Экспорт
	
	СоздатьНаОснованииМножественныйВыбор("Документ.СнятиеРезервов.ФормаОбъекта", МассивСсылок, ПараметрыВыполнения);
	
КонецПроцедуры

Процедура ВозвратПродукцииСоздатьНаОснованииЗаказаПокупателя(ЗаказСсылка, ПараметрыВыполнения) Экспорт
	
	// возврат на основании одного заказа	
	ПараметрыОткрытия = Новый Структура;
	ДопПараметры = СозданиеНаОснованииПотолкиВызовСервера.ПодготовитьСписокТоваровДляВыбораКВозвратуПродукции(ЗаказСсылка);
	ПараметрыОткрытия.Вставить("СписокПотолков", ДопПараметры.СписокПотолков);
	ПараметрыОткрытия.Вставить("СписокУслуг",    ДопПараметры.СписокУслуг);

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДокументОснование", ЗаказСсылка);
	ДополнительныеПараметры.Вставить("ПараметрыВыполнения", ПараметрыВыполнения);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВозвратПродукцииСоздатьНаОснованииЗаказаПокупателяЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Документ.ВозвратПродукции.Форма.ФормаВыбораПотолковКВозврату", ПараметрыОткрытия,,,ВариантОткрытияОкна.ОтдельноеОкно,,ОписаниеОповещения);
	
КонецПроцедуры

Процедура ВозвратПродукцииСоздатьНаОснованииЗаказаПокупателяЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ТипЗнч(Результат) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
		
	Если Результат.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметрыОткрытия = Новый Структура;
	ДополнительныеПараметрыОткрытия.Вставить("ДокументОснование", ДополнительныеПараметры.ДокументОснование);
	ДополнительныеПараметрыОткрытия.Вставить("МассивТоваров", Результат);
	
	СоздатьНаОснованииМножественныйВыбор("Документ.ВозвратПродукции.ФормаОбъекта", ДополнительныеПараметры.ДокументОснование, ДополнительныеПараметры.ПараметрыВыполнения, ДополнительныеПараметрыОткрытия);
	
КонецПроцедуры

Процедура ЗаказНаПроизводствоСоздатьНаОснованииЗаказаПокупателя(МассивСсылок, ПараметрыВыполнения) Экспорт
	
	СозданиеНаОснованииПотолкиВызовСервера.ПроверитьВозможностьВводаНаОснованииЗаказа(МассивСсылок, "ЗаказНаПроизводство");
	
	МассивПотолков = Новый Массив;
	МассивУслуг = Новый Массив;
	МассивМатериалов = Новый Массив;
	
	Для каждого ЗаказСсылка из МассивСсылок Цикл		
		ПараметрыСписокТоваров = СозданиеНаОснованииПотолкиВызовСервера.ПодготовитьСписокТоваровДляВыбораПользователемКПроизводству(ЗаказСсылка);	
		Для каждого ЭлементМассива из ПараметрыСписокТоваров.СписокПотолков Цикл
			МассивПотолков.Добавить(ЭлементМассива);
		КонецЦикла;
		Для каждого ЭлементМассива из ПараметрыСписокТоваров.СписокУслуг Цикл
			МассивУслуг.Добавить(ЭлементМассива);
		КонецЦикла;
		Для каждого ЭлементМассива из ПараметрыСписокТоваров.СписокМатериалов Цикл
			МассивМатериалов.Добавить(ЭлементМассива);
		КонецЦикла;
	КонецЦикла;
		
	ПараметрыФормыПроизводства = Новый Структура;
	ПараметрыФормыПроизводства.Вставить("СписокПотолков",   		МассивПотолков);		
	ПараметрыФормыПроизводства.Вставить("СписокУслуг",      		МассивУслуг);
	ПараметрыФормыПроизводства.Вставить("СписокМатериалов", 		МассивМатериалов);
	ПараметрыФормыПроизводства.Вставить("НастройкаИнтеркампани", 	ПараметрыСписокТоваров.НастройкаИнтеркампани);
		
	ДопПараметры = Новый Структура("МассивЗаказов", МассивСсылок);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДопПараметры, ПараметрыВыполнения);
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗаказНаПроизводствоСоздатьНаОснованииЗаказаПокупателяЗавершение", ЭтотОбъект, ДопПараметры);
		
	ОткрытьФорму("Документ.ЗаказПокупателя.Форма.ФормаЗаказаНаПроизводство",ПараметрыФормыПроизводства,,,ВариантОткрытияОкна.ОтдельноеОкно,,ОповещениеОЗакрытии);
	
КонецПроцедуры

Процедура ЗаказНаПроизводствоСоздатьНаОснованииЗаказаПокупателяЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	// Результат = Массив структур("Номенклатура, Заказ, ...")
	
	Если НЕ ТипЗнч(Результат) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
		
	Если Результат.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Товар к заказу на производство не был выбран");
		Возврат;
	КонецЕсли;
	
	//#10918 переделана схема: сначала открываем форму и в ней создаем документы
	ПараметрыФормы = Новый Структура;
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыФормы, ДополнительныеПараметры);
	ПараметрыФормы.Вставить("МассивНоменклатур", Результат);
	ПараметрыФормы.Удалить("Источник");
	ПараметрыФормы.Удалить("Форма");
	ПараметрыФормы.Удалить("ОписаниеКоманды");
	ОткрытьФорму("ОбщаяФорма.ФормаСозданныхИОбновленныхЗаказов", ПараметрыФормы, ЭтотОбъект, Новый УникальныйИдентификатор);
	
	////Создадим массив для вывода данных по созданным и обновленным заказам в одной форме
	//МассивСозданныхИОбновленныхЗаказов = Новый Массив;
	//
	//Для каждого ЗаказСсылка из ДополнительныеПараметры.МассивЗаказов Цикл
	//	ОбъектОтбора = ЗаказСсылка; // запоминаем 
	//	МассивНоменклатуры = Новый Массив;
	//	Для каждого ЭлементМассива из Результат Цикл
	//		Если ЭлементМассива.Заказ = ЗаказСсылка Тогда
	//			МассивНоменклатуры.Добавить(ЭлементМассива);
	//		КонецЕсли;
	//	КонецЦикла;			
	//	
	//	ЗаказСсылкаКеш = ЗаказСсылка;
	//	
	//	// из АРМ или списка заказов
	//	Если НЕ ДополнительныеПараметры.ЭтоФормаОбъекта Тогда
	//		СтруктураВозврата = ОбщийМодуль.СоздатьЗаказыНаПроизводствоПоЗаказам(ЗаказСсылка, МассивНоменклатуры, Истина);
	//	Иначе
	//		// из формы 
	//		СтруктураВозврата = ОбщийМодуль.СоздатьЗаказыНаПроизводствоПоЗаказам(ЗаказСсылка, МассивНоменклатуры, Истина);
	//		Оповестить("ОбновитьЗаказПокупателяПослеСозданияЗаказовНаПроизводство", ЗаказСсылкаКеш);
	//	КонецЕсли;		
	//			
	//	Для Каждого ТекущаяСтрока Из СтруктураВозврата.СозданоНовых Цикл
	//		МассивСозданныхИОбновленныхЗаказов.Добавить(Новый Структура("ЗаказПокупателя, ЗаказНаПроизводство, Создан, ПроведенВыпуск", ОбъектОтбора, ТекущаяСтрока, Истина, СтруктураВозврата.ПроведенВыпуск));
	//	КонецЦикла;
	//	
	//	Для Каждого ТекущаяСтрока Из СтруктураВозврата.Обновлено Цикл
	//		МассивСозданныхИОбновленныхЗаказов.Добавить(Новый Структура("ЗаказПокупателя, ЗаказНаПроизводство, Создан, ПроведенВыпуск", ОбъектОтбора, ТекущаяСтрока, Ложь, СтруктураВозврата.ПроведенВыпуск));
	//	КонецЦикла;
	//	
	//КонецЦикла;
	//
	//Оповестить("ОбновитьАРМПроизводства",,"ЗаказНаПроизводство");
	//Оповестить("ОбновитьАРМПроизводства",,"ЗаказПокупателя");
	//
	//Если МассивСозданныхИОбновленныхЗаказов.Количество() > 0 Тогда
	//	ОткрытьФорму("ОбщаяФорма.ФормаСозданныхИОбновленныхЗаказов", Новый Структура("МассивСозданныхИОбновленныхЗаказов", МассивСозданныхИОбновленныхЗаказов), ЭтотОбъект);
	//КонецЕсли;
	
КонецПроцедуры

Процедура ЗаказПоставщикуСоздатьНаОснованииЗаказаНаПроизводство(ДанныеЗаполнения, ПараметрыВыполнения) Экспорт
	
	//ДанныеЗаполнения - ссылка на документ
	
	ПараметрыНовогоДокумента = Новый Структура;
	ПараметрыНовогоДокумента.Вставить("ТолькоМатериалы", Истина);
	ПараметрыНовогоДокумента.Вставить("Основание", ДанныеЗаполнения);
	
	ПараметрыЗаполнения = Новый Структура("ЗначенияЗаполнения", ПараметрыНовогоДокумента);
	ОткрытьФорму("Документ.ЗаказПоставщику.ФормаОбъекта", ПараметрыЗаполнения);
	
КонецПроцедуры

Процедура ПоступлениеТоваровИУслугСоздатьНаОснованииЗаказаНаПроизводство(ДанныеЗаполнения, ПараметрыВыполнения) Экспорт
	
	//ДанныеЗаполнения - ссылка на документ
	
	ПараметрыНовогоДокумента = Новый Структура;
	ПараметрыНовогоДокумента.Вставить("ТолькоМатериалы", Истина);
	ПараметрыНовогоДокумента.Вставить("Основание", ДанныеЗаполнения);
	
	ПараметрыЗаполнения = Новый Структура("ЗначенияЗаполнения", ПараметрыНовогоДокумента);
	ОткрытьФорму("Документ.ПоступлениеТоваровИУслуг.ФормаОбъекта", ПараметрыЗаполнения);
	
КонецПроцедуры

Процедура РеализацияТоваровИУслугСоздатьНаОснованииЗаказаПокупателя(МассивСсылок, ПараметрыВыполнения) Экспорт
	
	//#5610 проверка из обработки заполнения Ртиу вынесена на клиента
	Для каждого ЗаказСсылка из МассивСсылок Цикл
		СтруктураПроверки = ОбщийМодульВызовСервера.ЭтоЗаказИнтеркампаниСОднойОрганизацией(ЗаказСсылка);
		Если СтруктураПроверки.Результат Тогда
			ПоказатьПредупреждение(, СтруктураПроверки.ТекстОшибки);
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	СозданиеНаОснованииПотолкиВызовСервера.ПроверитьВозможностьВводаНаОснованииЗаказа(МассивСсылок, "Реализация");
	
	Если МассивСсылок.Количество() = 1 Тогда
		СсылкаНаРеализацию = ОбщийМодульВызовСервера.ПолучитьРеализациюПоЗаказу(МассивСсылок[0]);
		
		ПараметрыНовогоДокумента = Новый Структура("Основание", МассивСсылок[0]);		
		Если СсылкаНаРеализацию = Неопределено Тогда
			ОткрытьФорму("Документ.РеализацияТоваровИУслуг.ФормаОбъекта", ПараметрыНовогоДокумента);
		Иначе
			ОписаниеОповещения = Новый ОписаниеОповещения("РеализацияТоваровИУслугСоздатьНаОснованииЗаказаПокупателяПослеВопроса", ЭтотОбъект, ПараметрыНовогоДокумента);
			ПоказатьВопрос(ОписаниеОповещения,"По документу уже оформлена реализация: " + СсылкаНаРеализацию + ". Создать новую реализацию?", РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
		
	Иначе
		// множественное создание
		ПараметрыНовогоДокумента = Новый Структура("ЗначенияЗаполнения", Новый Структура("МассивДокументов", МассивСсылок));
		ОткрытьФорму("Документ.РеализацияТоваровИУслуг.ФормаОбъекта", ПараметрыНовогоДокумента);
	КонецЕсли;
	
КонецПроцедуры

Процедура РеализацияТоваровИУслугСоздатьНаОснованииЗаказаПокупателяПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыНовогоДокумента = Новый Структура;
		ПараметрыНовогоДокумента.Вставить("Основание", ДополнительныеПараметры.Основание);
		ОткрытьФорму("Документ.РеализацияТоваровИУслуг.ФормаОбъекта", ПараметрыНовогоДокумента);
	КонецЕсли;
КонецПроцедуры

Процедура ВыпускПродукцииСоздатьНаОснованииЗаказаНаПроизводство(ДанныеЗаполнения, ПараметрыВыполнения) Экспорт
	
	//ДанныеЗаполнения - ссылка на документ, создание одиночного выпуска	
	ЗаказСсылка = ДанныеЗаполнения;
	
	// общие проверки: проведенность, статус
	СозданиеНаОснованииПотолкиВызовСервера.ПроверитьВозможностьОформленияВыпускаНаОснованииЗаказовНаПроизводство(ЗаказСсылка, Ложь);
	
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("ПараметрыВыполнения", ПараметрыВыполнения);
	ПараметрыОперации.Вставить("Заказ", ЗаказСсылка);
	ПараметрыОперации.Вставить("ЗначениеЗаполнения", ЗаказСсылка);
	// при вызове с
	// - РабочееМестоСотрудникаПроизводства (ШК)
	// - ФормаМассовогоВыпуска
	Если ТипЗнч(ПараметрыВыполнения) = Тип("Структура") И ПараметрыВыполнения.Свойство("ЗначениеЗаполнения") Тогда
		ПараметрыОперации.Вставить("ЗначениеЗаполнения", ПараметрыВыполнения.ЗначениеЗаполнения);
		ПараметрыОперации.Вставить("Неинтерактивно", Истина);
	КонецЕсли;	
	
	// проверка на соответствие ЗП и ЗНП
	//#14923 проверка расширена
	//Если ОбщийМодульВызовСервера.ОснованимЗаказаНаПроизводствоЯвляетсяЗаказПокупателя(ЗаказСсылка) Тогда	
	Если ОбщийМодульВызовСервера.ЗаказНаПроизводствоСвязанСЗаказомПокупателя(ЗаказСсылка) Тогда
		
		ЗаказПокупателяСсылка = ОбщийМодульВызовСервера.ПолучитьСсылкуНаОснование(ЗаказСсылка);
		ЭтоПроизводствоУникальнойПродукции = ОбщийМодульВызовСервера.ЭтоПроизводствоУникальнойПродукции(ЗаказСсылка);
		
		ТребуетсяПерезаполнениеЗнП = Ложь;
		
		СтруктураПроверки = ОбщийМодуль.ЗаказНаПроизводствоСоответствуетЗаказуПокупателя(ЗаказСсылка, ЗаказПокупателяСсылка);
		Если НЕ СтруктураПроверки.Результат Тогда
			
			Если ЭтоПроизводствоУникальнойПродукции Тогда 
				Если СтруктураПроверки.ЕстьПотолок Тогда
					ТребуетсяПерезаполнениеЗнП = Истина;
					
				Иначе
					ТекстОшибки = СтрШаблон("В основании ""%1"" отсутствует продукция документа ""%2""!", ЗаказПокупателяСсылка, ЗаказСсылка);
					ВызватьИсключение ТекстОшибки;
				КонецЕсли;
			Иначе
				ТребуетсяПерезаполнениеЗнП = Истина;
			КонецЕсли;
			
		КонецЕсли;	
		
		Если ТребуетсяПерезаполнениеЗнП Тогда
			
			ТекстВопроса = "Сведения по продукции%Дополнительно% в заказе покупателя, являющемся основанием, отличаются от данных в " + ЗаказСсылка + ".
							|Необходимо предварительно перезаполнить текущий заказ на производство по документу-основанию.
							|Выполнить перезаполнение заказа на производство (документ будет автоматически записан)?";
			
			Если ЭтоПроизводствоУникальнойПродукции Тогда							
				ТекстВопроса = СтрЗаменить(ТекстВопроса, "%Дополнительно%", " и её производственным услугам");
			Иначе
				ТекстВопроса = СтрЗаменить(ТекстВопроса, "%Дополнительно%", "");				
			КонецЕсли;
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ЭтоПроизводствоУникальнойПродукции", ЭтоПроизводствоУникальнойПродукции);
			ДополнительныеПараметры.Вставить("ЗаказНаПроизводство", ЗаказСсылка);
			ДополнительныеПараметры.Вставить("ЗаказНаПроизводствоОснование", ЗаказПокупателяСсылка);
			ДополнительныеПараметры.Вставить("ДоступноИзменениеПриНаличииВыпуска", СтруктураПроверки.ДоступноИзменениеПриНаличииВыпуска); // #13200	
			ДополнительныеПараметры.Вставить("ПараметрыОперации", ПараметрыОперации);
			
			ОписаниеОповещенияПослеВопроса = Новый ОписаниеОповещения("НачалоПерезаполненияЗаказаНаПроизводствоПоОснованию", ЭтотОбъект, ДополнительныеПараметры);
			
			ПоказатьВопрос(ОписаниеОповещенияПослеВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
			// дальнейшая обработка после вопроса
			Возврат;	
		КонецЕсли;
	КонецЕсли;

	ВыпускПродукцииСоздатьНаОснованииЗаказаНаПроизводствоФрагмент(ПараметрыОперации);

КонецПроцедуры

Процедура НачалоПерезаполненияЗаказаНаПроизводствоПоОснованию(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗнПУспешноПерезаполнен = Истина;
	ДоступноИзменениеПриНаличииВыпуска = ДополнительныеПараметры.ДоступноИзменениеПриНаличииВыпуска; // #13200
	//#14923 вызываем единую функцию перезаполнения ЗНП
	//Если ДополнительныеПараметры.ЭтоПроизводствоУникальнойПродукции Тогда
	//	СтруктураПотолка = ОбщийМодульВызовСервера.ПолучитьПотолокЗаказаНаПроизводство(ДополнительныеПараметры.ЗаказНаПроизводство);
	//	ОбщийМодуль.ОбновитьЗаказНаПроизводствоПоПотолкуПоЗаказуПокупателя(ДополнительныеПараметры.ЗаказНаПроизводство, СтруктураПотолка.Потолок, ДополнительныеПараметры.ЗаказНаПроизводствоОснование,,СтруктураПотолка.УИстроки, ДоступноИзменениеПриНаличииВыпуска);
	//Иначе
	//	ОбщийМодуль.ОбновитьЗаказНаТиповоеПроизводствоПоЗаказуПокупателя(ДополнительныеПараметры.ЗаказНаПроизводство, ДополнительныеПараметры.ЗаказНаПроизводствоОснование, , ДоступноИзменениеПриНаличииВыпуска);
	//КонецЕсли;
	ЗнПУспешноПерезаполнен = ОбщийМодуль.ОбновитьЗаказНаПроизводствоПоЗаказуПокупателя(ДополнительныеПараметры.ЗаказНаПроизводство, ДоступноИзменениеПриНаличииВыпуска);
	
	Если ЗнПУспешноПерезаполнен Тогда
		ПоказатьПредупреждение(, "Заказ на производство перезаполнен");
		ВыпускПродукцииСоздатьНаОснованииЗаказаНаПроизводствоФрагмент(ДополнительныеПараметры.ПараметрыОперации);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВыпускПродукцииСоздатьНаОснованииЗаказаНаПроизводствоФрагмент(ПараметрыОперации)
	
	// продолжаем создание выпуска
	ЗаказСсылка = ПараметрыОперации.Заказ;
	ВыпускСсылка = ОбщийМодульВызовСервера.НайтиДокументВыпускаПродукции(ЗаказСсылка);
	
	ОснованиеВыпуска = Новый Структура;
	ОснованиеВыпуска.Вставить("Заказ", ЗаказСсылка);
	
	ПараметрыОповещенияПослеЗакрытияВыпуска = Новый Структура;
	ПараметрыОповещенияПослеЗакрытияВыпуска.Вставить("Заказ", ЗаказСсылка);
	
	// если из ИзАРМСотрудникаПроизводства, то форму выпуска не показываем 
	Интерактивно = НЕ (ПараметрыОперации.Свойство("Неинтерактивно") И ПараметрыОперации.Неинтерактивно);
	
	Если ВыпускСсылка = ПредопределенноеЗначение("Документ.ВыпускПродукции.ПустаяСсылка") Тогда
		//если не нашли проведенный документ выпуска, попробуем найти созданный, но не проведенный.
		// #14923 - не ищем 
		//ВыпускСсылка = ОбщийМодульВызовСервера.ЕстьНеПроведенныйДокументВыпускаПоЭтомуЗаказу(ЗаказСсылка); 
		
		ПараметрыНовогоДокумента = Новый Структура;
		ПараметрыНовогоДокумента.Вставить("Перезаполнить", ЗначениеЗаполнено(ВыпускСсылка)); //!
		ПараметрыНовогоДокумента.Вставить("ЗначенияЗаполнения", ОснованиеВыпуска);
		ПараметрыНовогоДокумента.Вставить("Основание", ЗаказСсылка); //ОснованиеВыпуска);
		ПараметрыНовогоДокумента.Вставить("Ключ", ВыпускСсылка);
			 
		Если Интерактивно Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСозданияДокументаВыпуска", ЭтотОбъект, ПараметрыОповещенияПослеЗакрытияВыпуска);
			ОткрытьФорму("Документ.ВыпускПродукции.Форма.ФормаДокумента", ПараметрыНовогоДокумента,, Новый УникальныйИдентификатор(),,, ОписаниеОповещения);
		Иначе
			ОписаниеОшибки = ВыпускПродукцииСоздатьОбновитьНеинтерактивно(ПараметрыОперации.ЗначениеЗаполнения, ВыпускСсылка, ПараметрыОповещенияПослеЗакрытияВыпуска);
			Если ПараметрыОперации.Свойство("ПараметрыВыполнения")
				И ПараметрыОперации.ПараметрыВыполнения.Свойство("ОписаниеОшибки") Тогда
				ПараметрыОперации.ПараметрыВыполнения.ОписаниеОшибки = ОписаниеОшибки;
			КонецЕсли;
		КонецЕсли;	
	
	Иначе
		//предлагаем перезаполнить выпуск
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Заказ", ЗаказСсылка);
		ДополнительныеПараметры.Вставить("Выпуск", ВыпускСсылка);
		ДополнительныеПараметры.Вставить("ЗначениеЗаполнения", ПараметрыОперации.ЗначениеЗаполнения);
		ДополнительныеПараметры.Вставить("Интерактивно", Интерактивно);
		
		ПослеВопросаОПерезаполнении = Новый ОписаниеОповещения("ПослеВопросаОПерезаполненииВыпуска", ЭтотОбъект, ДополнительныеПараметры);
		ТекстВопроса = СтрШаблон("На основании заказа ""%1"" уже оформлен выпуск продукции. Перезаполнить существующий выпуск?", ЗаказСсылка);
		ПоказатьВопрос(ПослеВопросаОПерезаполнении, ТекстВопроса, РежимДиалогаВопрос.ДаНет);			
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеВопросаОПерезаполненииВыпуска(Результат, ДополнительныеПараметры) Экспорт
	
	ПараметрыОповещенияПослеЗакрытияВыпуска = Новый Структура;
	ПараметрыОповещенияПослеЗакрытияВыпуска.Вставить("Заказ", ДополнительныеПараметры.Заказ);
		
	Если Результат = КодВозвратаДиалога.Да Тогда		
		//пользователь согласился с перезаполнением документа		
		ОснованиеВыпуска = Новый Структура;
		ОснованиеВыпуска.Вставить("Заказ", ДополнительныеПараметры.Заказ);
		
		Если ДополнительныеПараметры.Интерактивно Тогда			
			ПараметрыНовогоДокумента = Новый Структура;
			ПараметрыНовогоДокумента.Вставить("Перезаполнить", Истина); //!
			ПараметрыНовогоДокумента.Вставить("ЗначенияЗаполнения", ОснованиеВыпуска);
			ПараметрыНовогоДокумента.Вставить("Основание", ДополнительныеПараметры.Заказ);
			ПараметрыНовогоДокумента.Вставить("Ключ", ДополнительныеПараметры.Выпуск);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСозданияДокументаВыпуска", ЭтотОбъект, ПараметрыОповещенияПослеЗакрытияВыпуска);
			ОткрытьФорму("Документ.ВыпускПродукции.Форма.ФормаДокумента", ПараметрыНовогоДокумента,,,,,ОписаниеОповещения);			
		Иначе
			ВыпускПродукцииСоздатьОбновитьНеинтерактивно(ДополнительныеПараметры.ЗначениеЗаполнения, ДополнительныеПараметры.Выпуск, ПараметрыОповещенияПослеЗакрытияВыпуска);
		КонецЕсли;
		
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда		
		//пользователь отказался от перезаполнения - просто открываем выпуск		
		Если ДополнительныеПараметры.Интерактивно Тогда			
			ПараметрыНовогоДокумента = Новый Структура;
			ПараметрыНовогоДокумента.Вставить("Ключ", ДополнительныеПараметры.Выпуск);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСозданияДокументаВыпуска", ЭтотОбъект, ПараметрыОповещенияПослеЗакрытияВыпуска);
			ОткрытьФорму("Документ.ВыпускПродукции.Форма.ФормаДокумента", ПараметрыНовогоДокумента,,,,,ОписаниеОповещения);			
		Иначе
			ПослеСозданияДокументаВыпуска(Неопределено, ПараметрыОповещенияПослеЗакрытияВыпуска);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ВыпускПродукцииСоздатьОбновитьНеинтерактивно(ЗначениеЗаполнения, ВыпускСсылка, ПараметрыОповещенияПослеЗакрытияВыпуска)
	
	ОписаниеОшибки = "";
	//#13345
	СозданныйВыпускПродукции = ОбщийМодульВызовСервера.СоздатьОбновитьВыпускПродукции(ЗначениеЗаполнения, ВыпускСсылка, ОписаниеОшибки);
	
	Если СозданныйВыпускПродукции <> Неопределено
		И НЕ СозданныйВыпускПродукции.Пустая() Тогда
		ПослеСозданияДокументаВыпуска(Неопределено, ПараметрыОповещенияПослеЗакрытияВыпуска);
	КонецЕсли;
	
	Возврат ОписаниеОшибки;
	
КонецФункции

Процедура ПослеСозданияДокументаВыпуска(Результат, ДополнительныеПараметры) Экспорт
	
	ЗаказСсылка = ДополнительныеПараметры.Заказ;
	ВыпускСсылка = ОбщийМодульВызовСервера.НайтиДокументВыпускаПродукции(ЗаказСсылка);
	
	Если ВыпускСсылка = ПредопределенноеЗначение("Документ.ВыпускПродукции.ПустаяСсылка") Тогда
		ПоказатьПредупреждение(,"Перевод в статус ""Произведен"" отменен - нет документа выпуска");
		
	ИначеЕсли ОбщийМодульВызовСервера.ВыпускСоответствуетЗаказу(ВыпускСсылка, ЗаказСсылка) Тогда
		Результат = ОбщийМодульВызовСервера.ИзменитьСтатусЗаказаНаПроизводствоНаПроизведен(ЗаказСсылка);
		Если Результат Тогда
			Оповестить("ИзмененСтатусЗаказаНаПроизводство", ЗаказСсылка, "ЗаказНаПроизводство");	
		КонецЕсли;
		
	Иначе
		ПоказатьПредупреждение(,"Заказ на производство не может быть переведен в статус ""Произведен"", т.к. выпуск не полностью соответствует заказу");
	КонецЕсли;
	
	Оповестить("ЗаписанЗаказНаПроизводство", ЗаказСсылка, "ЗаказНаПроизводство");
	Оповестить("ОбновитьАРМПроизводства",,"ЗаказНаПроизводство");
	Оповестить("ОбновитьАРМПроизводства",,"ЗаказПокупателя");
	
КонецПроцедуры

//#10995
Процедура ВыпускПродукцииМассовыйСоздатьНаОснованииЗаказаНаПроизводство(МассивСсылок, ПараметрыВыполнения = Неопределено) Экспорт
	
	СозданиеНаОснованииПотолкиВызовСервера.ПроверитьВозможностьОформленияВыпускаНаОснованииЗаказовНаПроизводство(МассивСсылок, Истина);
		
	ПараметрыФормыПроизводства = Новый Структура;
	ПараметрыФормыПроизводства.Вставить("СписокЗаказов", МассивСсылок);		
	
	ДопПараметры = Новый Структура;		
	ОткрытьФорму("Документ.ВыпускПродукции.Форма.ФормаМассовогоВыпуска", ПараметрыФормыПроизводства, , , ВариантОткрытияОкна.ОтдельноеОкно);
	
КонецПроцедуры

Процедура МонтажСоздатьНаОснованииВидОперацииРекламация(МассивСсылок, ПараметрыВыполнения) Экспорт
	
	Если МассивСсылок.Количество() > 0 Тогда
		ПараметрыНовогоДокумента = Новый Структура("ЗначенияЗаполнения", Новый Структура("Основание, ВидОперации", МассивСсылок[0], ПредопределенноеЗначение("Справочник.ВидыМонтажа.Рекламация")));				
		ОткрытьФорму("Документ.Монтаж.ФормаОбъекта", ПараметрыНовогоДокумента);
	КонецЕсли;
	
КонецПроцедуры

Процедура МонтажСоздатьНаОснованииВидОперацииСервиснаяЗаявка(МассивСсылок, ПараметрыВыполнения) Экспорт
	
	Если МассивСсылок.Количество() > 0 Тогда
		ПараметрыНовогоДокумента = Новый Структура("ЗначенияЗаполнения", Новый Структура("Основание, ВидОперации", МассивСсылок[0], ПредопределенноеЗначение("Справочник.ВидыМонтажа.СервиснаяЗаявка")));				
		ОткрытьФорму("Документ.Монтаж.ФормаОбъекта", ПараметрыНовогоДокумента);
	КонецЕсли;
	
КонецПроцедуры

Процедура МонтажСоздатьНаОснованииВидОперацииПродажа(МассивСсылок, ПараметрыВыполнения) Экспорт
	
	Если МассивСсылок.Количество() > 0 Тогда
		ПараметрыНовогоДокумента = Новый Структура("ЗначенияЗаполнения", Новый Структура("Основание, ВидОперации", МассивСсылок[0], ПредопределенноеЗначение("Справочник.ВидыМонтажа.Продажа")));				
		ОткрытьФорму("Документ.Монтаж.ФормаОбъекта", ПараметрыНовогоДокумента);
	КонецЕсли;
	
КонецПроцедуры

Процедура РезервированиеСоздатьНаОснованииДокументаРозницы(ДокументРезерва, ПараметрыВыполнения) Экспорт
	
	//СозданиеНаОснованииПотолкиВызовСервера.ПроверитьВозможностьВводаНаОснованииЗаказа(МассивСсылок);
	//
	//МассивПотолков = Новый Массив;
	//МассивУслуг = Новый Массив;
	//МассивМатериалов = Новый Массив;
	//
	//Для каждого ЗаказСсылка из МассивСсылок Цикл		
	//	ПараметрыСписокТоваров = СозданиеНаОснованииПотолкиВызовСервера.ПодготовитьСписокТоваровДляВыбораПользователемКПроизводству(ЗаказСсылка);	
	//	Для каждого ЭлементМассива из ПараметрыСписокТоваров.СписокПотолков Цикл
	//		МассивПотолков.Добавить(ЭлементМассива);
	//	КонецЦикла;
	//	Для каждого ЭлементМассива из ПараметрыСписокТоваров.СписокУслуг Цикл
	//		МассивУслуг.Добавить(ЭлементМассива);
	//	КонецЦикла;
	//	Для каждого ЭлементМассива из ПараметрыСписокТоваров.СписокМатериалов Цикл
	//		МассивМатериалов.Добавить(ЭлементМассива);
	//	КонецЦикла;
	//КонецЦикла;
	//	
	//ПараметрыФормыПроизводства = Новый Структура;
	//ПараметрыФормыПроизводства.Вставить("СписокПотолков",   		МассивПотолков);		
	//ПараметрыФормыПроизводства.Вставить("СписокУслуг",      		МассивУслуг);
	//ПараметрыФормыПроизводства.Вставить("СписокМатериалов", 		МассивМатериалов);
	//ПараметрыФормыПроизводства.Вставить("НастройкаИнтеркампани", 	ПараметрыСписокТоваров.НастройкаИнтеркампани);
	//	
	//ДопПараметры = Новый Структура("МассивЗаказов", МассивСсылок);
	//ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДопПараметры, ПараметрыВыполнения);
	//ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗаказНаПроизводствоСоздатьНаОснованииЗаказаПокупателяЗавершение", ЭтотОбъект, ДопПараметры);
	//	
	//ОткрытьФорму("Документ.ЗаказПокупателя.Форма.ФормаЗаказаНаПроизводство",ПараметрыФормыПроизводства,,,ВариантОткрытияОкна.ОтдельноеОкно,,ОповещениеОЗакрытии);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДокументРезерва", ДокументРезерва);
	
	ОткрытьФорму("ОбщаяФорма.ФормаРезервированиеИзРозницы", ПараметрыФормы,,, ВариантОткрытияОкна.ОтдельноеОкно);
	
КонецПроцедуры

Процедура ЗаказПокупателяСоздатьНаОснованииДокументаРозницы(ДокументСсылка, ПараметрыВыполнения) Экспорт
	
	ЭтоЗаказДоговор = ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказДоговор");
	
	РеквизитыДокумента = ОбщийМодульВызовСервера.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Организация, Подразделение, ТочкаПродаж");
	
	НастройкаИнтеркампани = ОбщийМодуль.ПолучитьНастройкуИнтеркампани(РеквизитыДокумента.ТочкаПродаж, РеквизитыДокумента.Подразделение, РеквизитыДокумента.Организация);
	Если НастройкаИнтеркампани.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не включено использование интеркампани или в настройках программы / текущего пользователя / точке продаж не заданы настройки интеркампани по умолчанию. Заказы не могут быть созданы.");
		Возврат;
	КонецЕсли;
	
	СписокТоваров = СозданиеНаОснованииПотолкиВызовСервера.ПодготовитьСписокТоваровДляВыбораПользователемКПроизводствуРозница(ДокументСсылка);
	Если СписокТоваров = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДокументСсылка", ДокументСсылка);
	ДополнительныеПараметры.Вставить("НастройкаИнтеркампани", НастройкаИнтеркампани);
	ДополнительныеПараметры.Вставить("ЭтоЗаказДоговор", ЭтоЗаказДоговор);
	ДополнительныеПараметры.Вставить("ЭтоМонтаж", НЕ ЭтоЗаказДоговор);
	ДополнительныеПараметры.Вставить("СписокТоваров", СписокТоваров);
	ДоступныАналогиМатериалов = Истина;
	Если НЕ ЭтоЗаказДоговор Тогда
		// монтаж
		ОснованиеДокумента = ОбщийМодульВызовСервера.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Основание");		
		ДоступныАналогиМатериалов = НЕ ЗначениеЗаполнено(ОснованиеДокумента) 
									ИЛИ ( ЗначениеЗаполнено(ОснованиеДокумента) И НЕ ТипЗнч(ОснованиеДокумента) = Тип("ДокументСсылка.ЗаказДоговор") );
	КонецЕсли;
	ДополнительныеПараметры.Вставить("ДоступныАналогиМатериалов", ДоступныАналогиМатериалов);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗаказПокупателяСоздатьНаОснованииДокументаРозницыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("ОбщаяФорма.ФормаЗаказаНаПроизводствоИзРозницы", ДополнительныеПараметры, , , ВариантОткрытияОкна.ОтдельноеОкно, , ОповещениеОЗакрытии);
	
КонецПроцедуры

Процедура ЗаказПокупателяСоздатьНаОснованииДокументаРозницыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	// Результат = структура("СписокЗаказать, ОжидаемаяДатаОтгрузки, ОжидаемоеВремяОтгрузки")
	
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
		
	Если Результат.СписокЗаказать.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Товар к заказу не был выбран");
		Возврат;
	КонецЕсли;
	
	СтруктураВозврата = ОбщийМодульВызовСервера.СоздатьЗаказыПокупателейНаПроизводствоРозница(Результат, ДополнительныеПараметры);
	Если СтруктураВозврата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьПредупреждение(,"Создание заказов покупателя на производство завершено" 
				+ Символы.ПС + "Создано новых заказов: " + СтруктураВозврата.СозданоНовых
				+ Символы.ПС + "Обновлено ранее оформленных заказов: " + СтруктураВозврата.Обновлено,, "Выполнено");
				
	Оповестить("ЗаказПокупателяСоздатьНаОснованииДокументаРозницыЗавершение", Результат, ДополнительныеПараметры.ДокументСсылка);
		
КонецПроцедуры

#КонецОбласти
